---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.BraceBelowSymbol
source: html/825c1d61-be16-df37-2f08-06e6651e8203.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.BraceBelowSymbol Property

The id of the ElementType to represent a brace below a beam in plan view.

## Syntax (C#)
```csharp
public ElementId BraceBelowSymbol { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null